test/aws_wrk_tests.results
Starting wrk tests.

Running 10s test @ http://citysearch:8080/v0/city/hello
  33 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    22.35ms   16.68ms 300.94ms   90.24%
    Req/Sec   141.89     57.20   252.00     53.95%
  46455 requests in 10.10s, 5.67MB read
Requests/sec:   4599.66
Transfer/sec:    574.96KB

Running 10s test @ http://citysearch:8080/v0/city/count
  33 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    92.77ms  112.95ms 717.58ms   84.85%
    Req/Sec    54.73     39.64   232.00     69.09%
  16945 requests in 10.10s, 4.19MB read
  Non-2xx or 3xx responses: 14344
Requests/sec:   1677.84
Transfer/sec:    424.46KB

Running 10s test @ http://citysearch:8080/v0/city/proximity_search?name=Daly%20City&k=10
  33 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   530.66ms  685.23ms   1.75s    66.94%
    Req/Sec     8.94     17.05    70.00     86.44%
  326 requests in 10.02s, 0.93MB read
  Socket errors: connect 0, read 0, write 0, timeout 78
  Non-2xx or 3xx responses: 190
Requests/sec:     32.55
Transfer/sec:     95.05KB

Running 10s test @ http://citysearch:8080/v0/city/proximity_search2?name=Daly%20City&k=10
  33 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    92.51ms  101.43ms   1.44s    96.21%
    Req/Sec    37.68     13.94   111.00     77.35%
  12090 requests in 10.10s, 58.61MB read
Requests/sec:   1196.98
Transfer/sec:      5.80MB

Running 10s test @ http://citysearch:8080/v0/city/text_search?q=San%20Francisco
  33 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   199.34ms  296.96ms   1.47s    83.21%
    Req/Sec    44.19     23.37   160.00     62.48%
  12528 requests in 10.10s, 73.42MB read
  Socket errors: connect 0, read 0, write 0, timeout 16
  Non-2xx or 3xx responses: 5500
Requests/sec:   1240.27
Transfer/sec:      7.27MB

Finished wrk tests.